Repository: pasosdeJesus/adJ
Catalog: doc/traduccion/po/*/man1/zshroadmap.1.po
Languages: es

source: February 14, 2020
es: Febrero 14 de 2020

source: NAME
es: NOMBRE

source: Completion
es: Completación

source: zshroadmap - informal introduction to the zsh manual The Zsh Manual, like the shell itself, is large and often complicated\&. This section of the manual provides some pointers to areas of the shell that are likely to be of particular interest to new users, and indicates where in the rest of the manual the documentation is to be found\&.
es: zshroadmap - introducción informal al manual de zsh El manual de Zsh, comoel interprete de ordenes en sí es grande y a menudo complicado\&. Esta sección del manual proporciona algunos indicadores sobre las áreas del interprete de ordenes que probablemente sean de especial interés para los nuevos usuarios, e indica en qué parte del resto del manual se encuentra la documentación\ &.

source: WHEN THE SHELL STARTS
es: CUANDO EL INTERPRETE DE ORDENES ARRANCA

source: When it starts, the shell reads commands from various files\&. These can be created or edited to customize the shell\&. See the section Startup/Shutdown Files in I<zsh>(1)\&.
es: Cuando inicia, el interprete de ordenes lee ordenes de varios archivos\&. Estos pueden ser creado o editados para personalizar el interprete de ordenes\&. Vea la sección Archivos/de Arranque y Terminación en I<zsh>(1)\&.

source: If no personal initialization files exist for the current user, a function is run to help you change some of the most common settings\&. It won\&'t appear if your administrator has disabled the B<zsh/newuser> module\&. The function is designed to be self-explanatory\&. You can run it by hand with `B<autoload -Uz zsh-newuser-install; zsh-newuser-install -f>\&'\&. See also the section User Configuration Functions in I<zshcontrib>(1)\&.
es: Si no existen archivos de inicialización personales para el usuario actual, se ejecuta una función para ayudarlo a cambiar algunas de las configuraciones más comunes\&. No aparecerá si su administrador ha desactivado el módulo B<zsh/newuser>\&. La función está diseñada para ser autoexplicativa\&. Puede ejecutarlo manualmente con `B<autoload -Uz zsh-newuser-install; zsh-newuser-install -f>\&'\&. Consulte también la sección Funciones de Configuración de Usuario en I<zshcontrib>(1)\&.

source: INTERACTIVE USE
es: USO INTERACTIVO

source: Interaction with the shell uses the builtin Zsh Line Editor, ZLE\&. This is described in detail in I<zshzle>(1)\&.
es: Las interacciones con el interprete de ordenes usan el Editor de Líneas de Zsh, ZLE\&. Esteeste se describe en detalle en I<zshzle>(1)\&.

source: The first decision a user must make is whether to use the Emacs or Vi editing mode as the keys for editing are substantially different\&. Emacs editing mode is probably more natural for beginners and can be selected explicitly with the command B<bindkey -e>\&.
es: La primera decisión que debe tomar un usuario es si usar el modo de edición Emacs o Vi, ya que las teclas para editar son sustancialmente diferentes\&. El modo de edición de Emacs es probablemente más natural para los principiantes y se puede seleccionar explícitamente con el comando B<bindkey -e>\&.

source: A history mechanism for retrieving previously typed lines (most simply with the Up or Down arrow keys) is available; note that, unlike other shells, zsh will not save these lines when the shell exits unless you set appropriate variables, and the number of history lines retained by default is quite small (30 lines)\&. See the description of the shell variables (referred to in the documentation as parameters) B<HISTFILE>, B<HISTSIZE> and B<SAVEHIST> in I<zshparam>(1)\&. Note that it\&'s currently only possible to read and write files saving history when the shell is interactive, i\&.e\&. it does not work from scripts\&.
es: Está disponible un mecanismo de historial para recuperar líneas escritas previamente (más simplemente con las teclas de flecha Arriba o Abajo); tenga en cuenta que, a diferencia de otros interpretes de ordenes, zsh no guardará estas líneas cuando el interprete de ordenes termine a menos que establezca las variables apropiadas, y el número de líneas de historial retenidas por defecto es bastante pequeño (30 líneas)\&. Vea la descripción de las variables del interprete de ordenes (referidas en la documentación como parámetros) B<HISTFILE>, B<HISTSIZE> y B<SAVEHIST> en I<zshparam>(1)\&. Tenga en cuenta que actualmente solo es posible leer y escribir el historial de guardado de archivos cuando el interprete de ordenes es interactivo, i\&.e\&. no funciona con scripts\&.

source: The shell now supports the UTF-8 character set (and also others if supported by the operating system)\&. This is (mostly) handled transparently by the shell, but the degree of support in terminal emulators is variable\&. There is some discussion of this in the shell FAQ, B<http://www\&.zsh\&.org/FAQ/>\&. Note in particular that for combining characters to be handled the option B<COMBINING_CHARS> needs to be set\&. Because the shell is now more sensitive to the definition of the character set, note that if you are upgrading from an older version of the shell you should ensure that the appropriate variable, either B<LANG> (to affect all aspects of the shell\&'s operation) or B<LC_CTYPE> (to affect only the handling of character sets) is set to an appropriate value\&. This is true even if you are using a single-byte character set including extensions of ASCII such as B<ISO-8859-1> or B<ISO-8859-15>\&. See the description of B<LC_CTYPE> in I<zshparam>(1)\&.
es: El interprete de ordenes ahora admite el juego de caracteres UTF-8 (y también otros si los admite el sistema operativo)\&. Esto se maneja (en su mayoría) de forma transparente por el interprete de ordenes, pero el grado de soporte en los emuladores de terminal es variable\&. Hay algo de discusión sobre esto en las preguntas frecuentes del interprete de ordenes, B<http://www\&.zsh\&.org/FAQ/>\&. Tenga en cuenta en particular que para la combinación de caracteres que se van a manejar, la opción B<COMBINING_CHARS> debe establecerse\&. Debido a que el interprete de ordenes ahora es más sensible a la definición del conjunto de caracteres, tenga en cuenta que si está actualizando desde una versión anterior del interprete de ordenes, debe asegurarse de que la variable apropiada, o B<LANG> (para afectar todos los aspectos del interprete de ordenes) o B<LC_CTYPE> (para afectar solo el manejo de juegos de caracteres) se establece en un valor apropiado\&. Esto es cierto incluso si está utilizando un conjunto de caracteres de un solo byte que incluye extensiones de ASCII como B<ISO-8859-1> o B<ISO-8859-15>\&. Vea la descripción de B<LC_CTYPE> en I<zshparam>(1)\&.

source: Completion is a feature present in many shells\&. It allows the user to type only a part (usually the prefix) of a word and have the shell fill in the rest\&. The completion system in zsh is programmable\&. For example, the shell can be set to complete email addresses in arguments to the mail command from your B<~/\&.abook/addressbook>; usernames, hostnames, and even remote paths in arguments to scp, and so on\&. Anything that can be written in or glued together with zsh can be the source of what the line editor offers as possible completions\&.
es: La finalización es una característica presente en muchos interpretes de ordenes\&. Permite al usuario escribir solo una parte (generalmente el prefijo) de una palabra y hacer que el interprete de ordens complete el resto\&. El sistema de finalización en zsh es programable\&. Por ejemplo, el interprete de ordenes puede configurarse para completar direcciones de correo electrónico en argumentos para el comando de correo de su B<~/\&.Abook/addressbook>; nombres de usuario, nombres de computadores e incluso rutas remotas en argumentos para scp, etc.\&. Todo lo que se pueda escribir o pegar junto con zsh puede ser la fuente de lo que ofrece el editor de líneas como posibles completaciones\&.

source: Zsh has two completion systems, an old, so called B<compctl> completion (named after the builtin command that serves as its complete and only user interface), and a new one, referred to as B<compsys>, organized as library of builtin and user-defined functions\&. The two systems differ in their interface for specifying the completion behavior\&. The new system is more customizable and is supplied with completions for many commonly used commands; it is therefore to be preferred\&.
es: Zsh tiene dos sistemas de completación, uno antiguo, denominado B<compctl> (llamado así por la orden incorporada que sirve como su única y completa interfaz de usuario), y uno nuevo, denominado B<compsys>, organizado como biblioteca de funciones integradas y definidas por el usuario\&. Los dos sistemas difieren en su interfaz para especificar el comportamiento de completación\&. El nuevo sistema es más personalizable y se suministra con complementos para muchas ordenes de uso común; por tanto, es preferible\&.

source: The completion system must be enabled explicitly when the shell starts\&. For more information see I<zshcompsys>(1)\&.
es: El sistema de completación debe habilitares explicitamente cuando el interprete de ordenes arranca\&. Para obtener más información vea I<zshcompsys>(1)\&.

source: Extending the line editor
es: Extendiendo el editor de líneas

source: Apart from completion, the line editor is highly extensible by means of shell functions\&. Some useful functions are provided with the shell; they provide facilities such as:
es: Fuera de la completación, el editoro de líneas es altamente extensible mediante funciones del interprete de ordenes\&. Algunas funciones útiles se suministran con el interprete de ordenes; da facilidades tales como:

source: composing characters not found on the keyboard
es: componiendo caracteres no encontrados en el teclado

source: configuring what the line editor considers a word when moving or deleting by word
es: configurando lo que el editor de líneas considera una palabra cuando se mueve o elimina de a palabra

source: alternative ways of searching the shell history
es: formas alternativas de buscar en la historia del interprete de ordenes

source: functions for replacing strings or patterns globally in the command line
es: funciones para rempalzar cadenas o patrones globalmente en la línea de ordenes

source: edit the command line with an external editor\&.
es: editar la línea de ordens con un editor externo\&.

source: See the section `ZLE Functions\&' in I<zshcontrib>(1) for descriptions of these\&.
es: Ver una descripción de estos en la sección `Funciones ZLE\&' en I<zshcontrib>(1).

source: OPTIONS
es: OPCIONES

source: The shell has a large number of options for changing its behaviour\&. These cover all aspects of the shell; browsing the full documentation is the only good way to become acquainted with the many possibilities\&. See I<zshoptions>(1)\&.
es: El interprete de ordenes tiene un amplio número de opciones para cambiar su comportamiento\&. Estas cubren todos los aspectos del interprete de ordenes; hojear la documentación completa es la única forma buena de acostumbrarse a las muchas posibilidads\&. Ver I<zshoptions>(1)\&.

source: PATTERN MATCHING
es: RECONOCIMIENTO DE PATRONES

source: The shell has a rich set of patterns which are available for file matching (described in the documentation as `filename generation\&' and also known for historical reasons as `globbing\&') and for use when programming\&. These are described in the section `Filename Generation\&' in I<zshexpn>(1)\&.
es: El interprete de ordenes tiene un rico conjunto de patrones que están disponibles para la concordancia de archivos (descritos en la documentación como `generación de nombre de archivo\& 'y también conocidos por razones históricas como`globbing\&') y para usar al programar\&. Estos se describen en la sección `Generación de Nombre de Archivo\&' en I<zshexpn>(1)\&.

source: Of particular interest are the following patterns that are not commonly supported by other systems of pattern matching:
es: De interes partícular son los siguientes patrones que no son soportados comunmente por otros sistemas de reconocimiento de patrones:

source: for matching over multiple directories
es: para que coincidan sobre multiples directorios

source: for matching either of two alternatives
es: para coincidir alguna de dos alternativas

source: the ability to exclude patterns from matching when the B<EXTENDED_GLOB> option is set
es: la habilidad para excluir patrones de la coincidencia cuando se establece la opción B<EXTENDED_GLOB>

source: glob qualifiers, included in parentheses at the end of the pattern, which select files by type (such as directories) or attribute (such as size)\&.
es: calificadores glob, incluidos entre paréntesis al final del patrón, que seleccionan archivos por tipo (tales como directorios) o atributos (tales como el tamaño)\&.

source: GENERAL COMMENTS ON SYNTAX
es: COMENTARIOS GENERALES SOBRE LA SINTAXIS

source: Although the syntax of zsh is in ways similar to the Korn shell, and therefore more remotely to the original UNIX shell, the Bourne shell, its default behaviour does not entirely correspond to those shells\&. General shell syntax is introduced in the section `Shell Grammar\&' in I<zshmisc>(1)\&.
es: Aunque la sintaxis de zsh es similar a la del interprete de ordenes de Korn y, por lo tanto, de forma más remota al intreprete de ordenes original de UNIX, el interprete de ordenes de Bourne, su comportamiento predeterminado no corresponde completamente con esos interpretes de ordenes\&. La sintaxis general del interprete de ordenes se introduce en la sección `Gramática del interprete de ordenes\&'en I<zshmisc>(1)\&.

source: One commonly encountered difference is that variables substituted onto the command line are not split into words\&. See the description of the shell option B<SH_WORD_SPLIT> in the section `Parameter Expansion\&' in I<zshexpn>(1)\&. In zsh, you can either explicitly request the splitting (e\&.g\&. B<${=foo}>) or use an array when you want a variable to expand to more than one word\&. See the section `Array Parameters\&' in I<zshparam>(1)\&.
es: Una diferencia que se encuentra comúnmente es que las variables sustituidas en la línea de ordenes no se dividen en palabras\&. Consulte la descripción de la opción B<SH_WORD_SPLIT> en la sección `Expansión de parámetros\&' en I<zshexpn>(1)\&. En zsh, puede solicitar explícitamente la división (e\&.g\&. B<$ {= foo}>) o usar una matriz cuando desee que una variable se expanda a más de una palabra\&. Consulte la sección `Parámetros de matriz\&' en I<zshparam>(1)\&.

source: PROGRAMMING
es: PROGAMACIÓN

source: The most convenient way of adding enhancements to the shell is typically by writing a shell function and arranging for it to be autoloaded\&. Functions are described in the section `Functions\&' in I<zshmisc>(1)\&. Users changing from the C shell and its relatives should notice that aliases are less used in zsh as they don\&'t perform argument substitution, only simple text replacement\&.
es: La forma más conveniente de agregar mejoras al interprete de ordenes es típicamente escribiendo una función y preparándola para que se cargue automáticamente\&. Las funciones se describen en la sección `Funciones\&' en I<zshmisc>(1)\&. Los usuarios que se cambian desde el interprete de ordenes C y sus parientes deben notar que los alias se usan menos en zsh ya que no realizan sustitución de argumentos, solo reemplazo de texto simple\&.

source: A few general functions, other than those for the line editor described above, are provided with the shell and are described in I<zshcontrib>(1)\&. Features include:
es: Unas pocas funciones generales, diferentes a las del editor de líneas antes descritas, se suministran con el interprete de ordenes y se describen en I<zshcontrib>(1)\&. Las características incluyen:

source: a prompt theme system for changing prompts easily, see the section `Prompt Themes\&'
es: Un sistema de temas para el promto para cambiar fácilmente los prompts, ver la sección `Temas de Prompt\&'

source: a MIME-handling system which dispatches commands according to the suffix of a file as done by graphical file managers
es: Un sistema para manejar MIME que lanza ordenes acordes al sufijo de un archivo como lo hacen los administradores de archivos graficos

source: a calculator
es: una calculadora

source: a version of B<xargs> that makes the B<find> command redundant
es: una versión de B<xargs> que haga la orden B<find> redundante

source: a command for renaming files by means of shell patterns\&.
es: una orden para renombrar archivos mediante patrones del interprete de ordenes\&.
